[
  {
    "product_name": "Xbox Series X Console - 1 TB",
    "price": 6649000,
    "description": "Garansi Indo - 1 Thn : Produk akan diperbaiki atau diganti baru tanpa biaya tambahan selama periode garansi di seluruh Indonesia. (PSE Warranty+)",
    "category": "Gaming",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2023/3/3/0d7fd12f-882e-4105-bdff-72128d3fe822.jpg.webp?ect=4g",
    "rating": { "rate": 5.0, "count": 165 },
    "stock": 48
  },
  {
    "product_name": "Apple Macbook Air M1 256 GB/13/8GB - Garansi Resmi iBox",
    "price": 10896000,
    "description": "Laptop Apple yang paling tipis dan ringan, bertenaga super dengan chip Apple M1. Tuntaskan berbagai proyek Anda dengan CPU 8-core super cepat. Tingkatkan aplikasi dan game kaya grafis ke level lebih tinggi dengan GPU hingga 8-core. Dan percepat tugas pembelajaran mesin dengan Neural Engine 16-core.",
    "category": "Komputer & Laptop",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2021/1/20/5b6654a2-4317-44ba-90f7-6333fa0f7bda.jpg",
    "rating": { "rate": 5.0, "count": 718 },
    "stock": 10
  },
  {
    "product_name": "SONY WH 1000XM4 / WH1000XM4 / Wireless Noise Canceling Headphones",
    "price": 3582000,
    "description": "Cerdas dan intuitif, headphone WH-1000XM4 menawarkan penyempurnaan lebih jauh pada noise cancelling canggih kami, kualitas suara yang luar biasa, dan mendengarkan cara cerdas yang mampu menyesuaikan diri dengan perilaku dan lokasi Anda.",
    "category": "Audio, Kamera & Elektronik Lainnya",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2021/11/8/7d0c4e67-8aed-41eb-8369-36d4eaca552c.jpg",
    "rating": { "rate": 4.9, "count": 683 },
    "stock": 8
  },
  {
    "product_name": "The North Face Men Crinkle Woven Wind Jkt-NF0A7WDMMPF - S",
    "price": 1603000,
    "description": "The North Face telah memperkenalkan koleksi pendakian nya, yang seperti namanya, diciptakan untuk para penjelajah alam terbuka yang ingin mengalami segala hal mulai dari gunung hingga hutan dan sungai",
    "category": "Olahraga",
    "image": "https://images.tokopedia.net/img/cache/200-square/hDjmkQ/2023/8/11/fe555876-f960-4d83-9a1c-bdeafd73353f.jpg",
    "rating": { "rate": 5.0, "count": 2 },
    "stock": 3
  },
  {
    "product_name": "Apple iPhone 14 Pro Garansi Resmi - 128GB 256GB 512GB 1TB",
    "price": 19399000,
    "description": "IPhone 14 Pro. Memotret detail menakjubkan dengan kamera Utama 48 MP. Nikmati iPhone dalam cara yang sepenuhnya baru dengan layar yang Selalu Aktif dan Dynamic Island. Deteksi Tabrakan, sebuah fitur keselamatan baru, memanggil bantuan saat Anda tak bisa.",
    "category": "Handphone & Tablet",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2023/2/4/6a115d00-bc7d-4d29-beb1-7939b44983f5.jpg.webp?ect=4g",
    "rating": { "rate": 4.9, "count": 645 },
    "stock": 13
  },
  {
    "product_name": "Alisan Kemeja Lengan Panjang Polos Slimfit Hitam PLSSFLSHITAM",
    "price": 199000,
    "description": "Kemeja warna yang satu ini akan membuat penampilan anda lebih bergaya pada saat bekerja, berpergian, dan acara formal. Kerah yang dilengkapi dengan tulang supaya kerah terlihat lebih gagah dan rapih. Jahitan yang di jahit dengan menggunakan teknologi mesin terbaru supaya kuat dan tidak mudah robek/rusak.",
    "category": "Fashion Pria",
    "image": "https://images.tokopedia.net/img/cache/200-square/product-1/2019/1/15/40367564/40367564_2bcb67b7-08d1-4755-8b31-c39480bf38ef_1200_1800.jpg",
    "rating": { "rate": 4.9, "count": 449 },
    "stock": 21
  },
  {
    "product_name": "Celana Panjang Jeans Slim fit Denim Cressida The Next Level L229B",
    "price": 344435,
    "description": "Jeans dengan aksen washed untuk edgy street look. Warna biru. Mid rise. Unlined. Slim fit. Kancing dan resleting depan. 2 kantong depan dan belakang. Material denim tidak transparan, agak tebal, dan tidak stretch",
    "category": "Fashion Pria",
    "image": "https://images.tokopedia.net/img/cache/200-square/hDjmkQ/2022/2/23/d0ef0514-6515-4d67-9e6f-0a5f19c41124.jpg",
    "rating": { "rate": 4.8, "count": 9 },
    "stock": 4
  },
  {
    "product_name": "Logitech G PRO X SUPERLIGHT Mouse Gaming Wireless E-Sports - Hitam",
    "price": 2099000,
    "description": "Singkirkan semua rintangan dari jalan menuju kemenangan dengan mouse PRO kami yang paling ringan dan paling cepat ini. Senjata pilihan terbaru untuk para atlet profesional esport terbaik, dengan berat kurang dari 63 gram dan menghadirkan glide yang nyaris tanpa friksi.. Komitmen kami untuk menyingkirkan semua rintangan dalam menciptakan koneksi yang semurni mungkin antara pemain dan game. Mouse PRO kami yang paling ringan, PRO X SUPERLIGHT adalah terobosan produk dengan berat kurang dari 63 gram, hampir 25% lebih ringan dibandingkan PRO Wireless mouse standar kami. Hal ini dicapai melalui proses pembuatan yang sangat teliti untuk menghasilkan pengurangan berat ekstrem tanpa mengurangi kinerja. Hanya fokus pada kemenangan dengan LIGHTSPEED, teknologi pro-grade wireless kami yang inovatif untuk kinerja yang responsif dan konektivitas yang mantap. Sensor HERO 25K DPI eksklusif dari Logitech G menghadirkan presisi, kecepatan, dan konsistensi tanpa saingan. PRO X SUPERLIGHT menghadirkan akurasi yang ekstrem dan kontrol yang sangat halus agar penuh percaya diri, khususnya selama momen sepersekian detik yang menegangkan saat beraksi di turnamen.",
    "category": "Komputer & Laptop",
    "image": "https://images.tokopedia.net/img/cache/300-square/VqbcmM/2023/7/1/1f0ed698-d638-4d4c-9fc7-e368d0715b79.jpg",
    "rating": { "rate": 5.0, "count": 2000 },
    "stock": 72
  },
  {
    "product_name": "TCL 43 inch QLED Google TV 4KUHD - Dolby Atmos/Vision - MEMC - 43Q6",
    "price": 4789000,
    "description": "Wide Color Gamut, High Contrast Ratio, 8 bit + FRC Color Depth. OK Google, Google Play stores, Google Kids Profile, Google Photos, Google TV. Bezel-Less, Metallic. Dolby Atmos, DTS-HD & Virtual-x. CPU: CA55*4@1.3GHz, GPU: G31 MP2, 800MHz, Memory: 2GB DDR+16GB Flash. Wi-Fi (2.4+5G), Bluetooth 5.0, HDMI2.1*1+HDMI2.0*2, USB3.0*1",
    "category": "Elektronik",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2023/7/13/6f6b666e-f5d9-4228-b779-a0253fb8c85d.jpg.webp?ect=4g",
    "rating": { "rate": 4.9, "count": 500 },
    "stock": 29
  },
  {
    "product_name": "Sony Playstation 5 PS5 Console Disc Edition",
    "price": 8025000,
    "description": "Rasakan pemuatan secepat kilat dengan SSD berkecepatan sangat tinggi, perendaman lebih dalam dengan dukungan untuk umpan balik haptic, pemicu adaptif, dan Audio 3D, dan generasi baru game PlayStation yang luar biasa.",
    "category": "Gaming",
    "image": "https://images.tokopedia.net/img/cache/200-square/VqbcmM/2023/11/15/1fbbdebb-d9cd-4b25-b342-a868af15a649.jpg.webp?ect=4g",
    "rating": { "rate": 5.0, "count": 366 },
    "stock": 16
  }
]
